{"translation-revision-date":"2025-07-03 08:54:11+0000","generator":"GlotPress\/4.0.1","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","plural-forms":"nplurals=6; plural=(n == 0) ? 0 : ((n == 1) ? 1 : ((n == 2) ? 2 : ((n % 100 >= 3 && n % 100 <= 10) ? 3 : ((n % 100 >= 11 && n % 100 <= 99) ? 4 : 5))));","lang":"ar"},"Setup was cancelled!":["تم إلغاء الإعداد!"],"Close this window":["إغلاق هذه النافذة"],"Go to Payments Overview":["الانتقال إلى نظرة عامة على المدفوعات"],"Great news — your WooPayments account has been activated. You can now start accepting payments on your store.":["أخبار رائعة — تم تفعيل حسابك على WooPayments. يمكنك الآن بدء قبول المدفوعات على متجرك."],"You’re ready to accept payments!":["أنت مستعد لقبول المدفوعات!"],"Thank you for your patience! Unfortunately, the test account creation is taking a bit longer than we anticipated. But don't worry — we won't give up! Feel free to close this modal and check back later. We appreciate your understanding!":["شكرًا لك على تحليك بالصبر! لسوء الحظ، يستغرق إنشاء حساب الاختبار وقتًا أطول قليلاً مما كنا نتوقع. لكن لا داعي للقلق — لن نستسلم! لا تتردد في إغلاق هذا النموذج والتحقق مرة أخرى لاحقًا. نقدِّر تفهمك!"],"The test account creation is taking a bit longer than expected, but don't worry — we're on it! Please bear with us for a few seconds more as we set everything up for your store.":["يستغرق إنشاء حساب الاختبار وقتًا أطول قليلاً مما كان متوقعًا، لكن لا داعي للقلق - فنحن نعمل على ذلك! يرجى التحلي بالصبر معنا لبضع ثوانٍ إضافية بينما نقوم بإعداد كل شيء لمتجرك."],"An error occurred while creating your test account. Please try again.":["حدث خطأ أثناء إنشاء حسابك التجريبي. يُرجى المحاولة مجددًا."],"Try Again":["المحاولة مجددًا"],"We've created a test account for you so that you can begin {{link}}testing payments on your store{{\/link}}.":["لقد أنشأنا حساب اختبار من أجلك حتى يمكنك بدء {{link}}مدفوعات الاختبار على متجرك{{\/link}}."],"Creating test account failed. Please try again.":["فشل إنشاء حساب الاختبار. تُرجى المحاولة مجددًا."],"In just a few moments, you'll be ready to test payments on your store.":["في غضون بضع لحظات، ستكون جاهزًا لاختبار المدفوعات على متجرك."],"Finishing payments setup":["إنهاء إعداد المدفوعات"],"Select which payment methods you'd like to offer to your shoppers. You can update these at any time.":["حدد طرق الدفع التي ترغب في تقديمها إلى المتسوقين لديك. يمكنك تحديث هذه الطرق هنا في أي وقت."],"Payment activation through our financial partner requires HTTPS and cannot be completed.":["يتطلب تفعيل الدفع من خلال شريكنا المالي HTTPS ويتعذر إكماله."],"Unable to start onboarding. If this problem persists, please contact support.":["يتعذر بدء الإعداد. إذا استمرت هذه المشكلة، فيُرجى التواصل مع الدعم الفني."],"By using %1$s, you agree to be bound by our {{tosLink}}Terms of Service{{\/tosLink}} (including {{merchantTermsLink}}%2$s merchant terms{{\/merchantTermsLink}}) and acknowledge that you have read our {{privacyPolicyLink}}Privacy Policy{{\/privacyPolicyLink}}.":["يعني استخدام ⁦%1$s⁩ أنك توافق على الالتزام {{tosLink}}بشروط الخدمة التي نقرِّها{{\/tosLink}} (بما في ذلك شروط التاجر الخاصة بـ {{merchantTermsLink}}%2$s{{\/merchantTermsLink}}) والإقرار بأنك قد قرأت {{privacyPolicyLink}}سياسة الخصوصية التي ننتهجها{{\/privacyPolicyLink}}."],"Select a country":["تحديد بلد"],"Please provide a type of goods or services":["يرجى تقديم نوع السلع أو الخدمات"],"Please provide a business type":["يُرجى إدخال نوع النشاط التجاري"],"Please provide a country":["يُرجى إدخال بلد"],"Please provide a response":["يُرجى تقديم رد"],"What type of goods or services does your business sell? ":["ما نوع السلع أو الخدمات التي يبيعها نشاطك التجاري؟ "],"What category of legal entity identify your business?":["ما تصنيف الكيان القانوني الذي يحدِّد نشاطك التجاري؟"],"What type of legal entity is your business?":["ما نوع الكيان القانوني الذي يمثِّل نشاطك التجاري؟"],"This info will verify your account":["ستتحقق هذه المعلومات من حسابك"],"Finish your verification process":["إنهاء عملية التحقق الخاصة بك"],"This will take place in a secure environment through our partner. Once your business details are verified, you’ll be redirected back to your store dashboard.":["سيتم ذلك في بيئة آمنة من خلال شريكنا. بمجرد التحقق من تفاصيل نشاطك التجاري، سيُعاد توجيهك مجددًا إلى لوحة تحكم متجرك."],"One last step! Verify your identity with our partner":["ثمَّة خطوة واحدة أخيرة! التحقق من هويتك مع شريكنا"],"This info will help us speed up the set up process.":["ستساعدنا هذه المعلومات على تسريع عملية الإعداد."],"Please share a few more details":["يرجى مشاركة مزيد من التفاصيل"],"We’ll use these details to enable payments for your store. This information can’t be changed after your account is created.":["سنستخدم هذه التفاصيل لتمكين المدفوعات في متجرك. يتعذر تغيير هذه المعلومات بعد إنشاء حسابك."],"Let’s get your store ready to accept payments":["لنجعل متجرك جاهزًا لقبول المدفوعات"],"You are currently testing payments on your store. To activate real payments, you will need to provide some additional details about your business. {{link}}Learn more{{\/link}}.":["أنت تختبر حاليًا المدفوعات على متجرك. لتفعيل المدفوعات الحقيقية، سيتعين عليك تقديم بعض التفاصيل الإضافية حول نشاطك التجاري. {{link}}تعرَّف على المزيد{{\/link}}."],"Start accepting real payments":["بدء قبول المدفوعات الحقيقية"],"Select if you have been granted tax-exempt status by the Internal Revenue Service (IRS)":["تحديد ما إذا كنت قد حصلت على حالة الإعفاء الضريبي من قِبل خدمة الإيرادات الداخلية (IRS) أم لا"],"Select if your business is classed as a government entity":["تحديد ما إذا كان قد تم تصنيف نشاطك التجاري ككيان حكومي أم لا"],"Select if you run a non-business entity":["تحديد ما إذا كنت تقوم بتشغيل كيان غير تجاري أم لا"],"Select if you filed documentation to register your business with a government agency":["تحديد ما إذا كنت قد قدمت مستندات لتسجيل نشاطك التجاري مع وكالة حكومية أم لا"],"Select if you run your own business as an individual and are self-employed":["تحديد ما إذا كنت تدير نشاطك التجاري الخاص كفرد وأنك تعمل لحسابك الخاص أم لا"],"Search…":["البحث..."],"You’ll be briefly redirected to connect your store to your WordPress.com account and unlock the full features and functionality of WooPayments":["ستتم إعادة توجيهك لفترة وجيزة لربط متجرك بحسابك على ووردبريس.كوم وفتح ميزات WooPayments ووظائفها بالكامل"],"Connect to WordPress.com":["الاتصال بووردبريس.كوم"],"Step %1$s of %2$s":["خطوة ⁦%1$s⁩ من ⁦%2$s⁩"],"Step active":["خطوة نشطة"],"Step completed":["الخطوة المكتملة"],"Payment provider actions":["إجراءات مزوِّدو الدفع"],"Provide some additional details about your business so you can begin accepting real payments. {{link}}Learn more{{\/link}}":["قدِّم بعض التفاصيل الإضافية حول نشاطك التجاري حتى يمكنك بدء قبول المدفوعات الحقيقية. {{link}}معرفة المزيد{{\/link}}"],"Failed to reset your WooPayments account.":["فشلت إعادة تعيين حسابك على WooPayments."],"Failed to deactivate the provider plugin.":["فشل إلغاء تنشيط مكوِّن المورد الإضافي."],"The provider plugin was successfully deactivated.":["تم إلغاء تنشيط مكون المورد الإضافي بنجاح."],"There are environment or store setup issues which are blocking progress. Please resolve them to proceed.":["توجد مشكلات في البيئة أو إعداد المتجر تعرقل التقدُّم. يُرجى حلها للمتابعة."],"When you reset your account, all payment data — including your %s account details, test transactions, and payouts history — will be lost. Your order history will remain. This action cannot be undone, but you can create a new test account at any time.":["عند إعادة تعيين حسابك، سيتم فقدان جميع بيانات الدفع، بما في ذلك تفاصيل حسابك على %s ومعاملات الاختبار ومحفوظات المدفوعات. ستبقى محفوظات طلبك. يتعذر التراجع عن هذا الإجراء، لكن يمكنك إنشاء حساب اختبار جديد في أي وقت."],"Your business location does not match your store location. {{link}}Edit store location.{{\/link}}":["لا يتطابق موقع أعمالك مع موقع متجرك. {{link}}تحرير موقع المتجر.{{\/link}}"],"Business location:":["موقع الأعمال:"],"Reactivate payments":["إعادة تفعيل المدفوعات"],"Test account":["اختبار الحساب"],"Installing":["تثبيت"],"This is an Official WooCommerce payment extension. <learnMoreLink \/>":["هذا ملحق دفع رسمي لـ WooCommerce. <learnMoreLink \/>"],"Official":["رسمي"],"Official WooCommerce extension badge":["شارة ملحق WooCommerce الرسمي"],"The provider could not be enabled. Check the Manage page for details.":["يتعذر تمكين المزود. تحقق من صفحة الإدارة للحصول على التفاصيل."],"Show more (%s)":["عرض المزيد (%s)"],"%s: There was a problem connecting your WordPress.com account — please try again.":["%s: حدثت مشكلة في أثناء الاتصال بحسابك على ووردبريس.كوم. يرجى المحاولة مجددًا."],"%s: An error occurred while setting up your sandbox account — please try again.":["%s: حدث خطأ في أثناء إعداد حسابك على sandbox - يرجى المحاولة مجددًا."],"See <termsLink \/> for details.":["اطلع على <termsLink \/> للحصول على التفاصيل."],"Incentive illustration":["رسم توضيحي للحوافز"],"Icon to indicate support for recurring payments":["أيقونة للإشارة إلى دعم المدفوعات المتكررة"],"Supports recurring payments":["يدعم المدفوعات المتكررة"],"Payment Provider Options":["خيارات مزوِّد الدفع"],"Test mode":["وضع الاختبار"],"Action needed":["الإجراء اللازم"],"Provide some additional details about your business so you can being accepting real payments. {{link}}Learn more{{\/link}}":["قدِّم بعض التفاصيل الاجتماعية حول أعمالك حتى يمكنك قبول المدفوعات الحقيقية. {{link}}معرفة المزيد{{\/link}}"],"Finish completing the tasks required to launch your store.":["أكمل المهام المطلوبة لبدء متجرك."],"What's next:":["الخطوة الآتية:"],"We've created a test account for you so that you can begin testing payments on your store. {{break\/}}Not sure what to test? Take a look at {{link}}how to test payments{{\/link}}.":["لقد أنشأنا حساب اختبار من أجلك حتى يمكنك بدء مدفوعات الاختبار على متجرك. {{break\/}}ألست متأكدًا مما يجب اختباره؟ ألقِ نظرة على {{link}}كيفية اختبار المدفوعات{{\/link}}."],"You're ready to test payments!":["أنت مستعد لاختبار المدفوعات!"],"Yes, reset account":["نعم، أعد تعيين الحساب"],"Are you sure you'd like to continue?":["هل ترغب بالتأكيد في الاستمرار؟"],"When you reset your test account, all payment data — including your %s account details, test transactions, and payouts history — will be lost. Your order history will remain. This action cannot be undone, but you can create a new test account at any time.":["عند إعادة تعيين حساب الاختبار الخاص بك، سيتم فقدان جميع بيانات الدفع، بما في ذلك تفاصيل حسابك على %s ومعاملات الاختبار ومحفوظات المدفوعات. ستبقى محفوظات طلبك. يتعذر التراجع عن هذا الإجراء، لكن يمكنك إنشاء حساب اختبار جديد في أي وقت."],"Reset your test account":["إعادة تعيين حساب الاختبار الخاص بك"],"Failed to disable the plugin.":["فشل تعطيل الإضافة."],"Reset account":["إعادة تعيين الحساب"],"Hide suggestion":["إخفاء الاقتراح"],"Failed to hide the payment extension suggestion.":["فشل إخفاء اقتراح تمديد الدفع."],"See Terms of Service":["الاطلاع على شروط الخدمة"],"See pricing & fees":["الاطلاع على الأسعار والرسوم"],"Clear search":["مسح البحث"],"No selection":["من دون تحديد"],"Currently selected: %s":["المحدَّد في الوقت الحالي: %s"],"More payment options":["مزيد من خيارات الدفع"],"Complete setup":["إعدادات كاملة"],"Activate payments":["تفعيل المدفوعات"],"An error occurred. You will be redirected to the settings page, try enabling the payment gateway there.":["حدث خطأ. سيُعاد توجيهك إلى صفحة الإعدادات، حاول تمكين بوابة المدفوعات هناك."],"Choose your payment methods":["اختيار طريقة الدفع الخاصة بك"],"Payment providers":["مزوِّدو الدفع"],"View documentation":["عرض الوثائق"],"Set up WooPayments":["إعداد WooPayments"],"Where is your business located?":["أين تقع شركتك؟"],"Other payment options":["خيارات الدفع الأخرى"],"Limited time offer":["عرض لفترة محدودة"],"Back":["رجوع"],"Select an option":["حدد خيارًا"],"Terms and Conditions":["الشروط والأحكام"],"Get support":["الحصول على الدعم"],"Install":["تنصيب"],"Continue your store setup":["متابعة إعداد المتجر الخاص بك"],"Dismiss this notice":["إخفاء هذه الملاحظة"],"Disable":["تعطيل"],"Deactivate":["تعطيل"],"Manage":["إدارة"],"Recommended":["موصى به"],"Connect":["الاتصال"],"Inactive":["غير نشط"],"Dismiss":["تجاهل"],"OR":["أو"],"Active":["مفعل"],"Enable":["تفعيل"],"Learn more":["معرفة المزيد"],"Apply":["تطبيق"],"Continue":["متابعة"],"Cancel":["إلغاء"],"Search":["البحث"]}},"comment":{"reference":"assets\/client\/admin\/chunks\/settings-payments-main.js"}}